dvucinozd/JC-ESP32P4-M3-DEV-Voice-Assistant-V2/main/main.c
#include "audio_player.h"
#include "bsp/display.h"
#include "bsp/esp-bsp.h"
#include "bsp_board_extra.h"
#include "driver/gpio.h"
#include "driver/ledc.h"
#include "driver/sdspi_host.h"
#include "driver/spi_common.h"
#include "esp_check.h"
#include "esp_err.h"
#include "esp_log.h"
#include "esp_spiffs.h"
#include "esp_vfs_fat.h"
#include "freertos/FreeRTOS.h"
#include "freertos/semphr.h"
#include "freertos/task.h"
#include "nvs_flash.h"
#include "sdkconfig.h"
#include "sdmmc_cmd.h"
#include <ctype.h>
#include <stdio.h>
#include <string.h>

#include "audio_capture.h"
#include "beep_tone.h"
#include "bsp/esp32_p4_function_ev_board.h"
#include "button_gpio.h"
#include "cJSON.h"
#include "config.h"
#include "connection_manager.h"
#include "file_iterator.h"
#include "ha_client.h"
#include "iot_button.h"
#include "led_status.h"
#include "local_music_player.h"
#include "mqtt_ha.h"
#include "network_manager.h"
#include "ota_update.h"
#include "timer_manager.h"
#include "tts_player.h"
#include "webserial.h"
#include "wifi_manager.h"
#include "wwd.h"

#define TAG "mp3_player"
#define BUTTON_IO_NUM 35
#define BUTTON_ACTIVE_LEVEL 0

// Forward declarations
static void music_player_event_handler(music_state_t state, int current_track, int total_tracks);
static void timer_finished_callback(uint8_t timer_id, const char *timer_name);
static void alarm_triggered_callback(uint8_t alarm_id, const char *alarm_label);
static void intent_handler(const char *intent_name, const char *intent_data, const char *conversation_id);
static void wwd_audio_feed_wrapper(const int16_t *audio_data, size_t samples);

static void conversation_response_handler(const char *response_text,
                                          const char *conversation_id) {
  // Check if this is a timer completion signal (empty string from run-end)
  if (response_text && strlen(response_text) == 0) {
    ESP_LOGI(TAG, "🔄 Timer pipeline completed - resuming wake word detection...");

    // Set LED back to IDLE
    led_status_set(LED_STATUS_IDLE);

    if (mqtt_ha_is_connected()) {
      mqtt_ha_update_sensor("va_status", "SPREMAN");
    }

    // Stop any ongoing audio capture before resuming wake word
    audio_capture_stop();
    vTaskDelay(pdMS_TO_TICKS(100)); // Small delay to ensure task stops

    // Stop WWD if it's already running (avoid "WWD already running" warning)
    wwd_stop();
    vTaskDelay(pdMS_TO_TICKS(50));

    // Resume wake word detection
    wwd_start();
    audio_capture_start_wake_word_mode(wwd_audio_feed_wrapper);
    vTaskDelay(pdMS_TO_TICKS(100)); // Give I2S time to initialize before task starts reading

    ESP_LOGI(TAG, "✅ Wake word detection resumed - ready for next command");
    return;
  }

  ESP_LOGI(TAG, "HA Response [%s]: %s",
           conversation_id ? conversation_id : "none", response_text);

  // Set LED to SPEAKING (cyan)
  led_status_set(LED_STATUS_SPEAKING);

  // ═══════════════════════════════════════════════════════════════════
  // >>> NOVO: Publish VA status i response za CYD display <<<
  // ═══════════════════════════════════════════════════════════════════
  if (mqtt_ha_is_connected()) {
    mqtt_ha_update_sensor("va_status", "GOVORIM...");
    if (response_text) {
      mqtt_ha_update_sensor("va_response", response_text);
    }
  }
  // ═══════════════════════════════════════════════════════════════════

  // Parse music control commands from HA response
  if (response_text && local_music_player_is_initialized()) {
    char *response_lower = strdup(response_text);
    if (response_lower) {
      for (char *p = response_lower; *p; p++) {
        *p = tolower((unsigned char)*p);
      }

      if (strstr(response_lower, "play music") ||
          strstr(response_lower, "start music") ||
          strstr(response_lower, "play song")) {
        ESP_LOGI(TAG, "🎵 Voice command: Play music");
        local_music_player_play();
      } else if (strstr(response_lower, "stop music") ||
                 strstr(response_lower, "stop song")) {
        ESP_LOGI(TAG, "🎵 Voice command: Stop music");
        local_music_player_stop();
      } else if (strstr(response_lower, "pause music") ||
                 strstr(response_lower, "pause song")) {
        ESP_LOGI(TAG, "🎵 Voice command: Pause music");
        local_music_player_pause();
      } else if (strstr(response_lower, "resume music") ||
                 strstr(response_lower, "resume song") ||
                 strstr(response_lower, "continue music")) {
        ESP_LOGI(TAG, "🎵 Voice command: Resume music");
        local_music_player_resume();
      } else if (strstr(response_lower, "next song") ||
                 strstr(response_lower, "next track") ||
                 strstr(response_lower, "skip")) {
        ESP_LOGI(TAG, "🎵 Voice command: Next track");
        local_music_player_next();
      } else if (strstr(response_lower, "previous song") ||
                 strstr(response_lower, "previous track") ||
                 strstr(response_lower, "go back")) {
        ESP_LOGI(TAG, "🎵 Voice command: Previous track");
        local_music_player_previous();
      }

      free(response_lower);
    }
  }
}

static void network_event_callback(network_type_t type, bool connected) {
  if (connected) {
    char ip_str[16];
    network_manager_get_ip(ip_str);

    ESP_LOGI(TAG, "========================================");
    ESP_LOGI(TAG, "Network Connected!");
    ESP_LOGI(TAG, "Type: %s", network_manager_type_to_string(type));
    ESP_LOGI(TAG, "IP Address: %s", ip_str);
    ESP_LOGI(TAG, "========================================");

    if (mqtt_ha_is_connected()) {
      mqtt_ha_update_sensor("network_type",
                            network_manager_type_to_string(type));
      mqtt_ha_update_sensor("ip_address", ip_str);
    }

    if (type == NETWORK_TYPE_ETHERNET) {
      ESP_LOGI(TAG, "📀 Ethernet active - mounting SD card for local music...");
      esp_err_t sd_ret = bsp_sdcard_mount();
      if (sd_ret == ESP_OK) {
        ESP_LOGI(
            TAG,
            "✅ SD card mounted successfully - local music playback enabled");

