dvucinozd/JC-ESP32P4-M3-DEV-Voice-Assistant-V2/main/main.c
        esp_err_t music_ret = local_music_player_init();
        if (music_ret == ESP_OK) {
          ESP_LOGI(TAG, "🎵 Local music player initialized - %d tracks found",
                   local_music_player_get_total_tracks());

          // Register music player event callback
          local_music_player_register_callback(music_player_event_handler);
          ESP_LOGI(TAG, "Music player event callback registered");

          if (mqtt_ha_is_connected()) {
            mqtt_ha_update_sensor("sd_card_status", "ready");
          }
        } else {
          ESP_LOGW(TAG, "⚠️  Music player init failed - no music files found?");
          if (mqtt_ha_is_connected()) {
            mqtt_ha_update_sensor("sd_card_status", "no_music");
          }
        }
      } else {
        ESP_LOGW(TAG, "⚠️  SD card mount failed - local music unavailable");
        if (mqtt_ha_is_connected()) {
          mqtt_ha_update_sensor("sd_card_status", "failed");
        }
      }
    } else if (type == NETWORK_TYPE_WIFI) {
      ESP_LOGI(TAG, "📶 WiFi fallback active - SD card disabled");

      if (local_music_player_is_initialized()) {
        ESP_LOGI(TAG, "Stopping local music player...");
        local_music_player_deinit();
      }

      if (bsp_sdcard != NULL) {
        ESP_LOGI(TAG, "Unmounting SD card (WiFi fallback mode)...");
        bsp_sdcard_unmount();
        if (mqtt_ha_is_connected()) {
          mqtt_ha_update_sensor("sd_card_status", "unmounted");
        }
      }
    }
  } else {
    ESP_LOGW(TAG, "Network disconnected: %s",
             network_manager_type_to_string(type));

    if (local_music_player_is_initialized()) {
      ESP_LOGI(TAG, "Stopping local music player...");
      local_music_player_deinit();
    }

    if (bsp_sdcard != NULL) {
      ESP_LOGI(TAG, "Unmounting SD card (network disconnected)...");
      bsp_sdcard_unmount();
      if (mqtt_ha_is_connected()) {
        mqtt_ha_update_sensor("sd_card_status", "disconnected");
      }
    }
  }
}

static bool music_paused_for_tts = false;

static void tts_audio_handler(const uint8_t *audio_data, size_t length) {
  ESP_LOGI(TAG, "Received TTS audio: %d bytes", length);

  if (local_music_player_is_initialized() &&
      local_music_player_get_state() == MUSIC_STATE_PLAYING) {
    ESP_LOGI(TAG, "Pausing music for TTS playback");
    local_music_player_pause();
    music_paused_for_tts = true;
  }

  esp_err_t ret = tts_player_feed(audio_data, length);
  if (ret != ESP_OK) {
    ESP_LOGW(TAG, "Failed to feed TTS audio: %s", esp_err_to_name(ret));
  }
}

static char *pipeline_handler = NULL;
static int audio_chunks_sent = 0;
static bool pipeline_active = false;
static int warmup_chunks_skip = 0;

static uint32_t vad_threshold = 180;
static uint32_t vad_silence_duration = 1800;
static uint32_t vad_min_speech = 200;
static uint32_t vad_max_recording = 7000;
static float wwd_threshold = 0.5f;

// AGC configuration
static bool agc_enabled = true; // Enabled by default
static uint16_t agc_target_level = 4000;

static void test_audio_streaming(void);
static void wwd_audio_feed_wrapper(const int16_t *audio_data, size_t samples);
static void on_wake_word_detected(wwd_event_t event, void *user_data);

static void mqtt_wwd_switch_callback(const char *entity_id,
                                     const char *payload) {
  ESP_LOGI(TAG, "MQTT: WWD switch = %s", payload);

  if (strcmp(payload, "ON") == 0) {
    wwd_start();
    audio_capture_start_wake_word_mode(wwd_audio_feed_wrapper);
    mqtt_ha_update_switch("wwd_enabled", true);
    led_status_set(LED_STATUS_IDLE); // Green - wake word ready
    ESP_LOGI(TAG, "Wake Word Detection enabled via MQTT");
  } else {
    wwd_stop();
    audio_capture_stop();
    mqtt_ha_update_switch("wwd_enabled", false);
    ESP_LOGI(TAG, "Wake Word Detection disabled via MQTT");
  }
}

static void mqtt_webserial_switch_callback(const char *entity_id,
                                           const char *payload) {
  ESP_LOGI(TAG, "MQTT: WebSerial switch = %s", payload);

  if (strcmp(payload, "ON") == 0) {
    if (!webserial_is_running()) {
      esp_err_t ret = webserial_init();
      if (ret == ESP_OK) {
        mqtt_ha_update_switch("webserial_enabled", true);
        ESP_LOGI(TAG, "WebSerial enabled via MQTT");
      } else {
        ESP_LOGE(TAG, "Failed to start WebSerial");
        mqtt_ha_update_switch("webserial_enabled", false);
      }
    }
  } else {
    if (webserial_is_running()) {
      webserial_deinit();
      mqtt_ha_update_switch("webserial_enabled", false);
      ESP_LOGI(TAG, "WebSerial disabled via MQTT");
    }
  }
}

static void mqtt_music_play_callback(const char *entity_id,
                                     const char *payload) {
  ESP_LOGI(TAG, "MQTT: Play music button pressed");
  if (local_music_player_is_initialized()) {
    local_music_player_play();
  } else {
    ESP_LOGW(TAG, "Music player not initialized (SD card not mounted?)");
  }
}

static void mqtt_music_stop_callback(const char *entity_id,
                                     const char *payload) {
  ESP_LOGI(TAG, "MQTT: Stop music button pressed");
  if (local_music_player_is_initialized()) {
    local_music_player_stop();
  }
}

static void mqtt_music_pause_callback(const char *entity_id,
                                      const char *payload) {
  ESP_LOGI(TAG, "MQTT: Pause music button pressed");
  if (local_music_player_is_initialized()) {
    local_music_player_pause();
  }
}

static void mqtt_music_resume_callback(const char *entity_id,
                                       const char *payload) {
  ESP_LOGI(TAG, "MQTT: Resume music button pressed");
  if (local_music_player_is_initialized()) {
    local_music_player_resume();
  }
}

static void mqtt_music_next_callback(const char *entity_id,
                                     const char *payload) {
  ESP_LOGI(TAG, "MQTT: Next track button pressed");
  if (local_music_player_is_initialized()) {
    local_music_player_next();
  }
}

static void mqtt_music_previous_callback(const char *entity_id,
                                         const char *payload) {
  ESP_LOGI(TAG, "MQTT: Previous track button pressed");
  if (local_music_player_is_initialized()) {
    local_music_player_previous();
  }
}

static void mqtt_restart_callback(const char *entity_id, const char *payload) {
  ESP_LOGI(TAG, "MQTT: Restart button pressed!");
  ESP_LOGI(TAG, "Restarting in 2 seconds...");
  vTaskDelay(pdMS_TO_TICKS(2000));
  esp_restart();
}

static void mqtt_test_tts_callback(const char *entity_id, const char *payload) {
  ESP_LOGI(TAG, "MQTT: Test TTS button pressed!");

  if (ha_client_is_connected()) {
    ESP_LOGI(TAG, "Requesting test TTS audio...");
    esp_err_t ret = ha_client_request_tts("Koliko je sati?");
    if (ret == ESP_OK) {
      ESP_LOGI(TAG, "Test TTS request sent successfully");
    } else {
      ESP_LOGE(TAG, "Failed to send test TTS request");
    }
  } else {
    ESP_LOGW(TAG, "Cannot test TTS - not connected to Home Assistant");
  }
}

static char ota_url_buffer[256] = "";

// Load OTA URL from NVS on startup
static void load_ota_url_from_nvs(void) {
  nvs_handle_t nvs;
  esp_err_t err = nvs_open("ota", NVS_READONLY, &nvs);
  if (err == ESP_OK) {
    size_t len = sizeof(ota_url_buffer);
    err = nvs_get_str(nvs, "url", ota_url_buffer, &len);
    if (err == ESP_OK && strlen(ota_url_buffer) > 0) {
      ESP_LOGI(TAG, "Loaded OTA URL from NVS: %s", ota_url_buffer);
    }
    nvs_close(nvs);
  }
}

// Save OTA URL to NVS
static void save_ota_url_to_nvs(const char *url) {
  nvs_handle_t nvs;
  esp_err_t err = nvs_open("ota", NVS_READWRITE, &nvs);
  if (err == ESP_OK) {
    nvs_set_str(nvs, "url", url);
    nvs_commit(nvs);
    nvs_close(nvs);
    ESP_LOGI(TAG, "OTA URL saved to NVS");
  }
}

