dvucinozd/JC-ESP32P4-M3-DEV-Voice-Assistant-V2/main/main.c
static void mqtt_ota_url_callback(const char *entity_id, const char *payload) {
  ESP_LOGI(TAG, "MQTT: OTA URL received: %s", payload);

  // Store URL in buffer
  strncpy(ota_url_buffer, payload, sizeof(ota_url_buffer) - 1);
  ota_url_buffer[sizeof(ota_url_buffer) - 1] = '\0';

  // Save to NVS for persistence
  save_ota_url_to_nvs(ota_url_buffer);

  // Update sensor to confirm receipt
  mqtt_ha_update_text("ota_url_input", ota_url_buffer);
  mqtt_ha_update_sensor("ota_url", ota_url_buffer);

  ESP_LOGI(TAG, "OTA URL stored: %s", ota_url_buffer);
}

static void mqtt_ota_trigger_callback(const char *entity_id,
                                      const char *payload) {
  ESP_LOGI(TAG, "MQTT: OTA update button pressed");

  if (strlen(ota_url_buffer) == 0) {
    ESP_LOGE(TAG, "OTA update failed: No URL configured");
    mqtt_ha_update_sensor("ota_status", "error: no URL");
    return;
  }

  if (ota_update_is_running()) {
    ESP_LOGW(TAG, "OTA update already in progress");
    mqtt_ha_update_sensor("ota_status", "already running");
    return;
  }

  ESP_LOGI(TAG, "Starting OTA update from: %s", ota_url_buffer);

  if (local_music_player_is_initialized() &&
      local_music_player_get_state() == MUSIC_STATE_PLAYING) {
    ESP_LOGI(TAG, "Stopping music for OTA update");
    local_music_player_stop();
  }

  mqtt_ha_update_sensor("ota_status", "starting");

  esp_err_t ret = ota_update_start(ota_url_buffer);
  if (ret != ESP_OK) {
    ESP_LOGE(TAG, "Failed to start OTA update");
    mqtt_ha_update_sensor("ota_status", "failed to start");
  }
}

static void ota_progress_callback(ota_state_t state, int progress,
                                  const char *message) {
  ESP_LOGI(TAG, "OTA [%d%%]: %s", progress, message);

  char progress_str[8];
  snprintf(progress_str, sizeof(progress_str), "%d", progress);
  mqtt_ha_update_sensor("ota_progress", progress_str);

  switch (state) {
  case OTA_STATE_IDLE:
    mqtt_ha_update_sensor("ota_status", "idle");
    break;
  case OTA_STATE_DOWNLOADING:
    mqtt_ha_update_sensor("ota_status", "downloading");
    break;
  case OTA_STATE_VERIFYING:
    mqtt_ha_update_sensor("ota_status", "verifying");
    break;
  case OTA_STATE_SUCCESS:
    mqtt_ha_update_sensor("ota_status", "success");
    break;
  case OTA_STATE_FAILED:
    mqtt_ha_update_sensor("ota_status", "failed");
    break;
  }
}

static void mqtt_vad_threshold_callback(const char *entity_id,
                                        const char *payload) {
  float value = atof(payload);
  vad_threshold = (uint32_t)value;
  ESP_LOGI(TAG, "MQTT: VAD threshold updated to %lu", vad_threshold);
  mqtt_ha_update_number("vad_threshold", (float)vad_threshold);
}

static void mqtt_vad_silence_callback(const char *entity_id,
                                      const char *payload) {
  float value = atof(payload);
  vad_silence_duration = (uint32_t)value;
  ESP_LOGI(TAG, "MQTT: VAD silence duration updated to %lums",
           vad_silence_duration);
  mqtt_ha_update_number("vad_silence_duration", (float)vad_silence_duration);
}

static void mqtt_vad_min_speech_callback(const char *entity_id,
                                         const char *payload) {
  float value = atof(payload);
  vad_min_speech = (uint32_t)value;
  ESP_LOGI(TAG, "MQTT: VAD min speech updated to %lums", vad_min_speech);
  mqtt_ha_update_number("vad_min_speech", (float)vad_min_speech);
}

static void mqtt_vad_max_recording_callback(const char *entity_id,
                                            const char *payload) {
  float value = atof(payload);
  vad_max_recording = (uint32_t)value;
  ESP_LOGI(TAG, "MQTT: VAD max recording updated to %lums", vad_max_recording);
  mqtt_ha_update_number("vad_max_recording", (float)vad_max_recording);
}

static void mqtt_wwd_threshold_callback(const char *entity_id,
                                        const char *payload) {
  wwd_threshold = atof(payload);
  ESP_LOGI(TAG, "MQTT: WWD threshold updated to %.2f", wwd_threshold);

  if (wwd_is_running()) {
    wwd_stop();
    audio_capture_stop();
    vTaskDelay(pdMS_TO_TICKS(100));

    wwd_config_t wwd_config = wwd_get_default_config();
    wwd_config.callback = on_wake_word_detected;
    wwd_config.user_data = NULL;
    wwd_config.detection_threshold = wwd_threshold;

    esp_err_t ret = wwd_init(&wwd_config);
    if (ret == ESP_OK) {
      wwd_start();
      audio_capture_start_wake_word_mode(wwd_audio_feed_wrapper);
      ESP_LOGI(TAG, "WWD restarted with new threshold");
    } else {
      ESP_LOGE(TAG, "Failed to restart WWD with new threshold");
    }
  }

  mqtt_ha_update_number("wwd_threshold", wwd_threshold);
}

// ═══════════════════════════════════════════════════════════════════════════
// AGC MQTT Callbacks
// ═══════════════════════════════════════════════════════════════════════════

static void mqtt_agc_switch_callback(const char *entity_id,
                                     const char *payload) {
  ESP_LOGI(TAG, "MQTT: AGC switch = %s", payload);

  if (strcmp(payload, "ON") == 0) {
    esp_err_t ret = audio_capture_enable_agc(agc_target_level);
    if (ret == ESP_OK) {
      agc_enabled = true;
      mqtt_ha_update_switch("agc_enabled", true);
      ESP_LOGI(TAG, "AGC enabled via MQTT");
    }
  } else {
    audio_capture_disable_agc();
    agc_enabled = false;
    mqtt_ha_update_switch("agc_enabled", false);
    ESP_LOGI(TAG, "AGC disabled via MQTT");
  }
}

static void mqtt_agc_target_callback(const char *entity_id,
                                     const char *payload) {
  float value = atof(payload);
  agc_target_level = (uint16_t)value;
  ESP_LOGI(TAG, "MQTT: AGC target level updated to %u", agc_target_level);

  if (agc_enabled) {
    audio_capture_set_agc_target(agc_target_level);
  }

  mqtt_ha_update_number("agc_target_level", (float)agc_target_level);
}

// ═══════════════════════════════════════════════════════════════════════════
// LED Status MQTT Callbacks
// ═══════════════════════════════════════════════════════════════════════════

static void mqtt_led_switch_callback(const char *entity_id,
                                     const char *payload) {
  bool enable = (strcmp(payload, "ON") == 0);
  ESP_LOGI(TAG, "MQTT: LED %s", enable ? "enabled" : "disabled");
  led_status_enable(enable);
  mqtt_ha_update_switch("led_enabled", enable);
}

