dvucinozd/JC-ESP32P4-M3-DEV-Voice-Assistant-V2/main/main.c
static void mqtt_led_brightness_callback(const char *entity_id,
                                         const char *payload) {
  float value = atof(payload);
  uint8_t brightness = (uint8_t)value;
  ESP_LOGI(TAG, "MQTT: LED brightness updated to %u%%", brightness);
  led_status_set_brightness(brightness);
  mqtt_ha_update_number("led_brightness", (float)brightness);
}

static void mqtt_status_update_task(void *arg) {
  while (1) {
    if (mqtt_ha_is_connected()) {
      mqtt_ha_update_sensor("wifi_rssi", "-45");

      char mem_str[32];
      uint32_t free_mem = esp_get_free_heap_size() / 1024;
      snprintf(mem_str, sizeof(mem_str), "%lu", (unsigned long)free_mem);
      mqtt_ha_update_sensor("free_memory", mem_str);

      char uptime_str[32];
      uint32_t uptime_sec = esp_log_timestamp() / 1000;
      snprintf(uptime_str, sizeof(uptime_str), "%lu",
               (unsigned long)uptime_sec);
      mqtt_ha_update_sensor("uptime", uptime_str);

      mqtt_ha_update_switch("wwd_enabled", wwd_is_running());

      mqtt_ha_update_switch("webserial_enabled", webserial_is_running());
      char webserial_clients_str[8];
      snprintf(webserial_clients_str, sizeof(webserial_clients_str), "%d",
               webserial_get_client_count());
      mqtt_ha_update_sensor("webserial_clients", webserial_clients_str);

      char ip_str[16];
      if (network_manager_get_ip(ip_str) == ESP_OK) {
        mqtt_ha_update_sensor("ip_address", ip_str);
      }
      mqtt_ha_update_sensor(
          "network_type",
          network_manager_type_to_string(network_manager_get_active_type()));

      // Report AGC current gain
      if (audio_capture_is_agc_enabled()) {
        char agc_gain_str[16];
        snprintf(agc_gain_str, sizeof(agc_gain_str), "%.2f",
                 audio_capture_get_agc_gain());
        mqtt_ha_update_sensor("agc_current_gain", agc_gain_str);
      }

      if (bsp_sdcard != NULL) {
        mqtt_ha_update_sensor("sd_card_status", "mounted");
      } else {
        mqtt_ha_update_sensor("sd_card_status", "not_mounted");
      }

      if (local_music_player_is_initialized()) {
        music_state_t state = local_music_player_get_state();
        const char *state_str;
        switch (state) {
        case MUSIC_STATE_PLAYING:
          state_str = "playing";
          break;
        case MUSIC_STATE_PAUSED:
          state_str = "paused";
          break;
        case MUSIC_STATE_STOPPED:
          state_str = "stopped";
          break;
        default:
          state_str = "idle";
          break;
        }
        mqtt_ha_update_sensor("music_state", state_str);

        char track_name[64];
        if (local_music_player_get_track_name(track_name, sizeof(track_name)) ==
            ESP_OK) {
          mqtt_ha_update_sensor("current_track", track_name);
        } else {
          mqtt_ha_update_sensor("current_track", "No track");
        }

        char total_tracks_str[16];
        snprintf(total_tracks_str, sizeof(total_tracks_str), "%d",
                 local_music_player_get_total_tracks());
        mqtt_ha_update_sensor("total_tracks", total_tracks_str);
      } else {
        mqtt_ha_update_sensor("music_state", "unavailable");
        mqtt_ha_update_sensor("current_track", "N/A");
        mqtt_ha_update_sensor("total_tracks", "0");
      }

      mqtt_ha_update_sensor("firmware_version",
                            ota_update_get_current_version());
      if (strlen(ota_url_buffer) > 0) {
        mqtt_ha_update_sensor("ota_url", ota_url_buffer);
      } else {
        mqtt_ha_update_sensor("ota_url", "Not configured");
      }
      if (!ota_update_is_running()) {
        mqtt_ha_update_sensor("ota_status", "idle");
        mqtt_ha_update_sensor("ota_progress", "0");
      }

      static bool config_published = false;
      if (!config_published) {
        mqtt_ha_update_number("vad_threshold", (float)vad_threshold);
        mqtt_ha_update_number("vad_silence_duration",
                              (float)vad_silence_duration);
        mqtt_ha_update_number("vad_min_speech", (float)vad_min_speech);
        mqtt_ha_update_number("vad_max_recording", (float)vad_max_recording);
        mqtt_ha_update_number("wwd_threshold", wwd_threshold);
        config_published = true;
      }
    }

    vTaskDelay(pdMS_TO_TICKS(10000));
  }
}

// ═══════════════════════════════════════════════════════════════════════════
// WAKE WORD DETECTION CALLBACK
// ═══════════════════════════════════════════════════════════════════════════
static void on_wake_word_detected(wwd_event_t event, void *user_data) {
  if (event == WWD_EVENT_DETECTED) {
    ESP_LOGI(TAG, "🎤 Wake word detected!");

    // Set LED to LISTENING (blue pulsing)
    led_status_set(LED_STATUS_LISTENING);

    // ═══════════════════════════════════════════════════════════════════
    // >>> NOVO: Publish VA status za CYD display <<<
    // ═══════════════════════════════════════════════════════════════════
    if (mqtt_ha_is_connected()) {
      mqtt_ha_update_sensor("va_status", "SLUŠAM...");
    }
    // ═══════════════════════════════════════════════════════════════════

    wwd_stop();
    audio_capture_stop();
    ESP_LOGI(TAG, "Wake word mode stopped");

    vTaskDelay(pdMS_TO_TICKS(100));

    ESP_LOGI(TAG, "🔊 Playing wake word confirmation beep...");
    extern esp_err_t beep_tone_play(uint16_t frequency, uint16_t duration,
                                    uint8_t volume);
    esp_err_t beep_ret = beep_tone_play(800, 120, 40);
    if (beep_ret != ESP_OK) {
      ESP_LOGW(TAG, "Failed to play beep tone: %s", esp_err_to_name(beep_ret));
    }

    vTaskDelay(pdMS_TO_TICKS(50));

    ESP_LOGI(TAG, "Starting voice pipeline...");
    test_audio_streaming();
  }
}

static void wwd_audio_feed_wrapper(const int16_t *audio_data, size_t samples) {
  wwd_feed_audio(audio_data, samples);
}

// ═══════════════════════════════════════════════════════════════════════════
// TTS PLAYBACK COMPLETE HANDLER
// ═══════════════════════════════════════════════════════════════════════════
static void tts_playback_complete_handler(void) {
  ESP_LOGI(TAG, "🔄 TTS playback complete - resuming wake word detection...");

  // ═══════════════════════════════════════════════════════════════════
  // >>> NOVO: Publish VA status za CYD display <<<
  // ═══════════════════════════════════════════════════════════════════
  if (mqtt_ha_is_connected()) {
    mqtt_ha_update_sensor("va_status", "SPREMAN");
  }
  // ═══════════════════════════════════════════════════════════════════

  // Set LED back to IDLE (dim green)
  led_status_set(LED_STATUS_IDLE);

