dvucinozd/JC-ESP32P4-M3-DEV-Voice-Assistant-V2/main/main.c
  if (music_paused_for_tts && local_music_player_is_initialized()) {
    ESP_LOGI(TAG, "Resuming music playback after TTS");
    local_music_player_resume();
    music_paused_for_tts = false;
  }

  wwd_start();
  audio_capture_start_wake_word_mode(wwd_audio_feed_wrapper);

  ESP_LOGI(TAG, "✅ Wake word detection resumed - ready for next command");
}

// ═══════════════════════════════════════════════════════════════════════════
// PIPELINE ERROR HANDLER
// ═══════════════════════════════════════════════════════════════════════════
static void pipeline_error_handler(const char *error_code, const char *error_message) {
  ESP_LOGE(TAG, "Pipeline error occurred: %s - %s", error_code, error_message);

  // Set LED to ERROR (red blinking)
  led_status_set(LED_STATUS_ERROR);

  // Clean up pipeline state
  pipeline_active = false;
  if (pipeline_handler != NULL) {
    free(pipeline_handler);
    pipeline_handler = NULL;
  }
  audio_chunks_sent = 0;

  ESP_LOGI(TAG, "Pipeline state cleaned up, resuming wake word detection in 2 seconds...");

  // Wait a bit before resuming wake word mode
  vTaskDelay(pdMS_TO_TICKS(2000));

  // Resume wake word detection
  wwd_start();
  audio_capture_start_wake_word_mode(wwd_audio_feed_wrapper);

  // Set LED to IDLE (green)
  led_status_set(LED_STATUS_IDLE);

  ESP_LOGI(TAG, "✅ Wake word detection resumed after pipeline error");
}

// ═══════════════════════════════════════════════════════════════════════════
// MUSIC PLAYER EVENT HANDLER
// ═══════════════════════════════════════════════════════════════════════════
static void music_player_event_handler(music_state_t state, int current_track, int total_tracks) {
  ESP_LOGI(TAG, "Music player state changed: %d (track %d/%d)", state, current_track + 1, total_tracks);

  if (state == MUSIC_STATE_STOPPED) {
    ESP_LOGI(TAG, "Music playback stopped - resuming wake word detection...");

    // Set LED back to IDLE (green)
    led_status_set(LED_STATUS_IDLE);

    // Resume wake word detection
    wwd_start();
    audio_capture_start_wake_word_mode(wwd_audio_feed_wrapper);

    ESP_LOGI(TAG, "✅ Wake word detection resumed after music stopped");
  }
}

// ═══════════════════════════════════════════════════════════════════════════
// TIMER FINISHED CALLBACK
// ═══════════════════════════════════════════════════════════════════════════
static void timer_finished_callback(uint8_t timer_id, const char *timer_name) {
  ESP_LOGI(TAG, "⏰ Timer finished: %d '%s'", timer_id, timer_name);

  // Update MQTT sensor
  if (mqtt_ha_is_connected()) {
    mqtt_ha_update_sensor("timer_status", "finished");
    mqtt_ha_update_sensor("timer_finished", timer_name ? timer_name : "");
  }

  // Stop audio capture before playing beeps (beep_tone reinitializes I2S)
  ESP_LOGI(TAG, "Stopping wake word detection for timer beeps...");
  audio_capture_stop();
  vTaskDelay(pdMS_TO_TICKS(100));

  // Play beep sound (3 beeps)
  for (int i = 0; i < 3; i++) {
    beep_tone_play(1000, 200, 90); // 1kHz, 200ms, 90% volume
    vTaskDelay(pdMS_TO_TICKS(300));
  }

  // Resume wake word detection
  ESP_LOGI(TAG, "Resuming wake word detection after timer beeps...");
  vTaskDelay(pdMS_TO_TICKS(200)); // Delay after last beep for codec to stabilize

  // Stop WWD if it's already running (avoid "WWD already running" warning)
  wwd_stop();
  vTaskDelay(pdMS_TO_TICKS(50));

  wwd_start();
  audio_capture_start_wake_word_mode(wwd_audio_feed_wrapper);
  vTaskDelay(pdMS_TO_TICKS(100)); // Give I2S time to initialize before task starts reading

  ESP_LOGI(TAG, "Timer notification complete");
}

// ═══════════════════════════════════════════════════════════════════════════
// ALARM TRIGGERED CALLBACK
// ═══════════════════════════════════════════════════════════════════════════
static void alarm_triggered_callback(uint8_t alarm_id, const char *alarm_label) {
  ESP_LOGI(TAG, "⏰ Alarm triggered: %d '%s'", alarm_id, alarm_label);

  // Get current time
  char time_str[32];
  timer_manager_get_time_string(time_str, sizeof(time_str));
  ESP_LOGI(TAG, "Current time: %s", time_str);

  // Update MQTT sensor
  if (mqtt_ha_is_connected()) {
    mqtt_ha_update_sensor("alarm_status", "triggered");
    mqtt_ha_update_sensor("alarm_triggered", alarm_label ? alarm_label : "");
  }

  // Stop audio capture before playing beeps (beep_tone reinitializes I2S)
  ESP_LOGI(TAG, "Stopping wake word detection for alarm beeps...");
  audio_capture_stop();
  vTaskDelay(pdMS_TO_TICKS(100));

  // Play alarm sound (continuous beeps for 5 seconds)
  for (int i = 0; i < 10; i++) {
    beep_tone_play(1500, 250, 90); // 1.5kHz, 250ms, 90% volume
    vTaskDelay(pdMS_TO_TICKS(250));
  }

  // Resume wake word detection
  ESP_LOGI(TAG, "Resuming wake word detection after alarm beeps...");
  vTaskDelay(pdMS_TO_TICKS(200)); // Delay after last beep for codec to stabilize

  // Stop WWD if it's already running (avoid "WWD already running" warning)
  wwd_stop();
  vTaskDelay(pdMS_TO_TICKS(50));

  wwd_start();
  audio_capture_start_wake_word_mode(wwd_audio_feed_wrapper);
  vTaskDelay(pdMS_TO_TICKS(100)); // Give I2S time to initialize before task starts reading

  ESP_LOGI(TAG, "Alarm notification complete");
}

// ═══════════════════════════════════════════════════════════════════════════
// INTENT HANDLER (Timer/Alarm Voice Commands)
// ═══════════════════════════════════════════════════════════════════════════
static void intent_handler(const char *intent_name, const char *intent_data, const char *conversation_id) {
  ESP_LOGI(TAG, "🎯 Intent recognized: %s", intent_name);
  ESP_LOGI(TAG, "Intent data: %s", intent_data);

  // Parse intent data JSON
  cJSON *data = cJSON_Parse(intent_data);
  if (!data) {
    ESP_LOGW(TAG, "Failed to parse intent data JSON");
    return;
  }

  // Extract targets array
  cJSON *targets = cJSON_GetObjectItem(data, "targets");
  if (!targets || !cJSON_IsArray(targets) || cJSON_GetArraySize(targets) == 0) {
    ESP_LOGW(TAG, "No targets in intent data");
    cJSON_Delete(data);
    return;
  }

  cJSON *target = cJSON_GetArrayItem(targets, 0);

