dvucinozd/JC-ESP32P4-M3-DEV-Voice-Assistant-V2/main/main.c
  // Check for timer-related intents
  if (strstr(intent_name, "timer") != NULL || strstr(intent_name, "Timer") != NULL) {

    int duration_sec = 0;
    const char *timer_name = "Voice Timer";

    // First check if duration is directly provided (from STT parsing)
    cJSON *duration_field = cJSON_GetObjectItem(target, "duration");
    if (duration_field && cJSON_IsNumber(duration_field)) {
      duration_sec = duration_field->valueint;
      ESP_LOGI(TAG, "Timer duration from intent: %d seconds", duration_sec);
    }
    // Otherwise, try to parse from target name
    else {
      cJSON *name = cJSON_GetObjectItem(target, "name");
      if (name && name->valuestring) {
        ESP_LOGI(TAG, "Timer request: %s", name->valuestring);
        timer_name = name->valuestring;

        // Simple duration parsing (supports "X minute" or "X minuta")
        int minutes = 0, seconds = 0;

        // Try to parse minutes
        if (sscanf(name->valuestring, "%d minute", &minutes) == 1 ||
            sscanf(name->valuestring, "%d minuta", &minutes) == 1 ||
            sscanf(name->valuestring, "%d min", &minutes) == 1) {
          duration_sec = minutes * 60;
        }
        // Try to parse seconds
        else if (sscanf(name->valuestring, "%d second", &seconds) == 1 ||
                 sscanf(name->valuestring, "%d sekund", &seconds) == 1 ||
                 sscanf(name->valuestring, "%d sec", &seconds) == 1) {
          duration_sec = seconds;
        }
        // Try combined format "X minute Y second"
        else if (sscanf(name->valuestring, "%d minute %d second", &minutes, &seconds) == 2 ||
                 sscanf(name->valuestring, "%d minuta %d sekund", &minutes, &seconds) == 2) {
          duration_sec = (minutes * 60) + seconds;
        }
      }
    }

    if (duration_sec > 0) {
      ESP_LOGI(TAG, "Starting timer for %d seconds (%d minutes)", duration_sec, duration_sec / 60);

      // Start timer using timer_manager
      uint8_t timer_id;
      esp_err_t ret = timer_manager_start_timer(timer_name, duration_sec, &timer_id);

      if (ret == ESP_OK) {
        ESP_LOGI(TAG, "✅ Timer %d started successfully", timer_id);

        // Play confirmation beep (2 quick beeps = success)
        beep_tone_play(1200, 100, 90); // 1.2kHz, 100ms, 90% volume
        vTaskDelay(pdMS_TO_TICKS(120));
        beep_tone_play(1200, 100, 90);

        // Update MQTT sensor
        if (mqtt_ha_is_connected()) {
          char timer_info[64];
          snprintf(timer_info, sizeof(timer_info), "Timer %d: %ds", timer_id, duration_sec);
          mqtt_ha_update_sensor("timer_status", timer_info);
        }
      } else {
        ESP_LOGE(TAG, "❌ Failed to start timer (error: %d)", ret);

        // Play error beep (low tone)
        beep_tone_play(400, 300, 60);
      }
    } else {
      ESP_LOGW(TAG, "Could not parse timer duration");
    }
  }
  // Check for alarm-related intents
  else if (strstr(intent_name, "alarm") != NULL || strstr(intent_name, "Alarm") != NULL) {
    ESP_LOGI(TAG, "Alarm intent detected (not yet implemented)");
    // TODO: Parse time from intent and create alarm
  }

  cJSON_Delete(data);
}

// ═══════════════════════════════════════════════════════════════════════════
// VAD EVENT HANDLER
// ═══════════════════════════════════════════════════════════════════════════
static void vad_event_handler(audio_capture_vad_event_t event) {
  switch (event) {
  case VAD_EVENT_SPEECH_START:
    ESP_LOGI(TAG, "🎤 Speech detected - recording...");
    break;

  case VAD_EVENT_SPEECH_END:
    ESP_LOGI(TAG, "🔇 Silence detected - VAD auto-stop triggered");
    ESP_LOGI(TAG, "Total audio chunks sent: %d", audio_chunks_sent);

    // ═══════════════════════════════════════════════════════════════════
    // >>> NOVO: Publish VA status za CYD display <<<
    // ═══════════════════════════════════════════════════════════════════
    if (mqtt_ha_is_connected()) {
      mqtt_ha_update_sensor("va_status", "OBRAĐUJEM...");
    }
    // ═══════════════════════════════════════════════════════════════════

    // Set LED to PROCESSING (yellow blinking)
    led_status_set(LED_STATUS_PROCESSING);

    pipeline_active = false;
    audio_capture_stop();
    ESP_LOGI(TAG, "Audio capture stopped - I2S freed for TTS");

    ha_client_end_audio_stream();

    if (pipeline_handler != NULL) {
      free(pipeline_handler);
      pipeline_handler = NULL;
    }
    audio_chunks_sent = 0;

    ESP_LOGI(TAG,
             "Waiting for TTS playback to complete before resuming WWD...");
    break;
  }
}

static void audio_capture_handler(const uint8_t *audio_data, size_t length) {
  if (!pipeline_active || pipeline_handler == NULL) {
    return;
  }

  if (audio_data == NULL || length == 0) {
    return;
  }

  if (warmup_chunks_skip > 0) {
    warmup_chunks_skip--;
    ESP_LOGD(TAG, "Skipping warmup chunk (%d remaining)", warmup_chunks_skip);
    return;
  }

  esp_err_t ret = ha_client_stream_audio(audio_data, length, pipeline_handler);
  if (ret == ESP_OK) {
    audio_chunks_sent++;
  } else {
    ESP_LOGW(TAG, "Failed to stream audio chunk - pipeline may be closed");
  }
}

static void test_audio_streaming(void) {
  ESP_LOGI(TAG, "========================================");
  ESP_LOGI(TAG, "Starting Audio Streaming Test with VAD");
  ESP_LOGI(TAG, "========================================");

  vad_config_t vad_config = {.sample_rate = 16000,
                             .speech_threshold = vad_threshold,
                             .silence_duration_ms = vad_silence_duration,
                             .min_speech_duration_ms = vad_min_speech,
                             .max_recording_ms = vad_max_recording};

  ESP_LOGI(TAG,
           "📊 VAD Config: threshold=%lu, silence=%lums, min_speech=%lums, "
           "max=%lums",
           vad_config.speech_threshold, vad_config.silence_duration_ms,
           vad_config.min_speech_duration_ms, vad_config.max_recording_ms);

  esp_err_t ret = audio_capture_enable_vad(&vad_config, vad_event_handler);
  if (ret != ESP_OK) {
    ESP_LOGE(TAG, "Failed to enable VAD");
    return;
  }

