dvucinozd/JC-ESP32P4-M3-DEV-Voice-Assistant-V2/main/main.c
  pipeline_handler = ha_client_start_conversation();
  if (pipeline_handler == NULL) {
    ESP_LOGE(TAG, "Failed to start pipeline");
    return;
  }

  ESP_LOGI(TAG, "Pipeline started: %s", pipeline_handler);
  ESP_LOGI(TAG, "🎙️  Start speaking now! (VAD will auto-stop after silence)");

  audio_chunks_sent = 0;
  pipeline_active = true;
  warmup_chunks_skip = 10;

  audio_capture_reset_vad();

  ret = audio_capture_start(audio_capture_handler);
  if (ret != ESP_OK) {
    ESP_LOGE(TAG, "Failed to start audio capture");
    free(pipeline_handler);
    pipeline_handler = NULL;
  }
}

void app_main(void) {
  ESP_LOGI(TAG, "===== ESP32-P4 Voice Assistant Starting =====");
  ESP_LOGI(TAG, "===== Firmware Version: 2.1.0 (CYD Integration) =====");

  esp_err_t ret = nvs_flash_init();
  if (ret == ESP_ERR_NVS_NO_FREE_PAGES ||
      ret == ESP_ERR_NVS_NEW_VERSION_FOUND) {
    ESP_ERROR_CHECK(nvs_flash_erase());
    ret = nvs_flash_init();
  }
  ESP_ERROR_CHECK(ret);
  ESP_LOGI(TAG, "NVS initialized");

  ESP_LOGI(TAG, "Initializing OTA update module...");
  ret = ota_update_init();
  if (ret == ESP_OK) {
    ESP_LOGI(TAG, "OTA module initialized - Version: %s",
             ota_update_get_current_version());
    ota_update_register_callback(ota_progress_callback);

    // Load previously saved OTA URL from NVS
    load_ota_url_from_nvs();
  } else {
    ESP_LOGW(TAG, "OTA module initialization failed");
  }

  // ═══════════════════════════════════════════════════════════════════════
  // Initialize LED Status Indicator
  // ═══════════════════════════════════════════════════════════════════════
  ESP_LOGI(TAG, "Initializing LED status indicator...");
  ret = led_status_init();
  if (ret == ESP_OK) {
    ESP_LOGI(TAG, "LED status initialized (R=%d, G=%d, B=%d)", LED_GPIO_RED,
             LED_GPIO_GREEN, LED_GPIO_BLUE);
    // Set LED to yellow - system booting
    led_status_set(LED_STATUS_BOOTING);
  } else {
    ESP_LOGW(TAG, "LED status initialization failed");
  }

  ESP_LOGI(TAG, "Initializing ES8311 audio codec...");
  ESP_ERROR_CHECK(bsp_extra_codec_init());
  bsp_extra_codec_volume_set(40, NULL);
  bsp_extra_player_init();
  ESP_LOGI(TAG, "ES8311 codec initialized successfully");

  ESP_LOGI(TAG, "Initializing TTS player...");
  ret = tts_player_init();
  if (ret != ESP_OK) {
    ESP_LOGW(TAG, "TTS player initialization failed");
  } else {
    ESP_LOGI(TAG, "TTS player initialized successfully");
  }

  ESP_LOGI(TAG, "Initializing audio capture...");
  ret = audio_capture_init();
  if (ret != ESP_OK) {
    ESP_LOGW(TAG, "Audio capture initialization failed");
  } else {
    ESP_LOGI(TAG, "Audio capture initialized successfully");
  }

  ESP_LOGI(TAG,
           "WakeNet models will be loaded from flash (managed_components)");

  ESP_LOGI(TAG, "Initializing Wake Word Detection...");
  wwd_config_t wwd_config = wwd_get_default_config();
  wwd_config.callback = on_wake_word_detected;
  wwd_config.user_data = NULL;
  wwd_config.detection_threshold = wwd_threshold;
  ESP_LOGI(TAG, "WWD threshold: %.2f, VAD threshold: %lu", wwd_threshold,
           vad_threshold);
  esp_err_t wwd_ret = wwd_init(&wwd_config);

  if (wwd_ret != ESP_OK) {
    ESP_LOGE(TAG, "Wake Word Detection initialization failed!");
    ESP_LOGW(TAG, "Falling back to VAD-based activation");
  } else {
    ESP_LOGI(TAG, "Wake Word Detection initialized successfully!");
  }

  ESP_LOGI(TAG, "Initializing Network Manager...");
  // Set LED to purple pulsing - connecting to network
  led_status_set(LED_STATUS_CONNECTING);
  network_manager_register_callback(network_event_callback);
  ret = network_manager_init();
  if (ret == ESP_OK && network_manager_is_connected()) {
    ESP_LOGI(TAG, "Network connected successfully!");
    ESP_LOGI(TAG, "Active network: %s",
             network_manager_type_to_string(network_manager_get_active_type()));

    // ═══════════════════════════════════════════════════════════════════════
    // Initialize Connection Manager for auto-reconnection
    // ═══════════════════════════════════════════════════════════════════════
    connection_manager_config_t conn_config =
        connection_manager_get_default_config();
    ret = connection_manager_init(&conn_config);
    if (ret == ESP_OK) {
      ESP_LOGI(TAG, "Connection Manager initialized");

      // Register HA WebSocket for monitoring (reconnect via ha_client_init)
      connection_manager_register(CONN_TYPE_HA_WEBSOCKET, "HA WebSocket",
                                  ha_client_init);

      // Register MQTT for monitoring (reconnect via mqtt_ha_start)
      connection_manager_register(CONN_TYPE_MQTT, "MQTT", mqtt_ha_start);

      // Start connection manager monitoring
      connection_manager_start();
      ESP_LOGI(TAG, "Connection Manager started - auto-reconnection enabled");
    } else {
      ESP_LOGW(TAG,
               "Connection Manager init failed - auto-reconnection disabled");
    }
    // ═══════════════════════════════════════════════════════════════════════

    ESP_LOGI(TAG, "Connecting to Home Assistant...");
    ret = ha_client_init();
    if (ret == ESP_OK) {
      ESP_LOGI(TAG, "Home Assistant connected successfully!");

      ha_client_register_conversation_callback(conversation_response_handler);
      ha_client_register_tts_audio_callback(tts_audio_handler);
      ha_client_register_error_callback(pipeline_error_handler);
      ha_client_register_intent_callback(intent_handler);
      tts_player_register_complete_callback(tts_playback_complete_handler);

      // ═══════════════════════════════════════════════════════════════════════
      // Initialize Timer/Alarm Manager
      // ═══════════════════════════════════════════════════════════════════════
      ESP_LOGI(TAG, "Initializing Timer/Alarm Manager...");

      // Initialize SNTP for time synchronization
      timer_manager_init_sntp("CET-1CEST,M3.5.0,M10.5.0/3"); // Central European Time

      timer_manager_config_t timer_config = {
        .timer_finished_callback = timer_finished_callback,
        .alarm_triggered_callback = alarm_triggered_callback,
        .snooze_duration_sec = 600, // 10 minutes
        .tts_notifications = true,
        .play_sound = true
      };

      ret = timer_manager_init(&timer_config);
      if (ret == ESP_OK) {
        ESP_LOGI(TAG, "✅ Timer/Alarm Manager initialized");
      } else {
        ESP_LOGW(TAG, "⚠️  Timer/Alarm Manager initialization failed");
      }
      // ═══════════════════════════════════════════════════════════════════════

      ESP_LOGI(TAG, "Initializing MQTT Home Assistant Discovery...");
      mqtt_ha_config_t mqtt_config = {.broker_uri = MQTT_BROKER_URI,
                                      .username = MQTT_USERNAME,
                                      .password = MQTT_PASSWORD,
                                      .client_id = MQTT_CLIENT_ID};

      ret = mqtt_ha_init(&mqtt_config);
      if (ret == ESP_OK) {
        ESP_LOGI(TAG, "MQTT client initialized");

        ret = mqtt_ha_start();
        if (ret == ESP_OK) {
          ESP_LOGI(TAG, "MQTT client started");

          vTaskDelay(pdMS_TO_TICKS(2000));

          ESP_LOGI(TAG, "Registering Home Assistant entities...");

          // Sensors
          mqtt_ha_register_sensor("network_type", "Network Type", NULL, NULL);
          mqtt_ha_register_sensor("ip_address", "IP Address", NULL, NULL);
          mqtt_ha_register_sensor("sd_card_status", "SD Card Status", NULL,
                                  NULL);
          mqtt_ha_register_sensor("wifi_rssi", "WiFi Signal", "dBm",
                                  "signal_strength");
          mqtt_ha_register_sensor("free_memory", "Free Memory", "KB", NULL);
          mqtt_ha_register_sensor("uptime", "Uptime", "s", "duration");

          // ═══════════════════════════════════════════════════════════════════
          // >>> NOVO: VA Status senzori za CYD display integraciju <<<
          // ═══════════════════════════════════════════════════════════════════
          mqtt_ha_register_sensor("va_status", "VA Status", NULL, NULL);
          mqtt_ha_register_sensor("va_response", "VA Response", NULL, NULL);
          // ═══════════════════════════════════════════════════════════════════

          // Switches
          mqtt_ha_register_switch("wwd_enabled", "Wake Word Detection",
                                  mqtt_wwd_switch_callback);
          mqtt_ha_register_switch("webserial_enabled", "WebSerial Console",
                                  mqtt_webserial_switch_callback);

