dvucinozd/JC-ESP32P4-M3-DEV-Voice-Assistant-V2/main/main.c
          // Sensors - WebSerial
          mqtt_ha_register_sensor("webserial_clients", "WebSerial Clients",
                                  NULL, NULL);

          // Buttons - System
          mqtt_ha_register_button("restart", "Restart Device",
                                  mqtt_restart_callback);
          mqtt_ha_register_button("test_tts", "Test TTS",
                                  mqtt_test_tts_callback);

          // Buttons - Music Player
          mqtt_ha_register_button("music_play", "Play Music",
                                  mqtt_music_play_callback);
          mqtt_ha_register_button("music_stop", "Stop Music",
                                  mqtt_music_stop_callback);
          mqtt_ha_register_button("music_pause", "Pause Music",
                                  mqtt_music_pause_callback);
          mqtt_ha_register_button("music_resume", "Resume Music",
                                  mqtt_music_resume_callback);
          mqtt_ha_register_button("music_next", "Next Track",
                                  mqtt_music_next_callback);
          mqtt_ha_register_button("music_previous", "Previous Track",
                                  mqtt_music_previous_callback);

          // Sensors - Music Player
          mqtt_ha_register_sensor("music_state", "Music State", NULL, NULL);
          mqtt_ha_register_sensor("current_track", "Current Track", NULL, NULL);
          mqtt_ha_register_sensor("total_tracks", "Total Tracks", NULL, NULL);

          // Sensors - OTA Update
          mqtt_ha_register_sensor("firmware_version", "Firmware Version", NULL,
                                  NULL);
          mqtt_ha_register_sensor("ota_status", "OTA Status", NULL, NULL);
          mqtt_ha_register_sensor("ota_progress", "OTA Progress", "%", NULL);
          mqtt_ha_register_sensor("ota_url", "OTA Update URL", NULL, NULL);

          // Text input for OTA URL
          mqtt_ha_register_text("ota_url_input", "OTA URL Input",
                                mqtt_ota_url_callback);

          // Button to trigger OTA update
          mqtt_ha_register_button("ota_trigger", "Trigger OTA Update",
                                  mqtt_ota_trigger_callback);

          // Number controls for VAD tuning
          mqtt_ha_register_number("vad_threshold", "VAD Speech Threshold", 50,
                                  300, 10, NULL, mqtt_vad_threshold_callback);
          mqtt_ha_register_number("vad_silence_duration",
                                  "VAD Silence Duration", 1000, 3000, 100, "ms",
                                  mqtt_vad_silence_callback);
          mqtt_ha_register_number("vad_min_speech", "VAD Min Speech Duration",
                                  100, 500, 50, "ms",
                                  mqtt_vad_min_speech_callback);
          mqtt_ha_register_number("vad_max_recording",
                                  "VAD Max Recording Duration", 5000, 10000,
                                  500, "ms", mqtt_vad_max_recording_callback);

          // Number control for WWD tuning
          mqtt_ha_register_number("wwd_threshold", "WWD Detection Threshold",
                                  0.3, 0.9, 0.05, NULL,
                                  mqtt_wwd_threshold_callback);

          // ═══════════════════════════════════════════════════════════════════
          // AGC Controls
          // ═══════════════════════════════════════════════════════════════════
          mqtt_ha_register_switch("agc_enabled", "Auto Gain Control",
                                  mqtt_agc_switch_callback);
          mqtt_ha_register_number("agc_target_level", "AGC Target Level", 1000,
                                  8000, 500, NULL, mqtt_agc_target_callback);
          mqtt_ha_register_sensor("agc_current_gain", "AGC Current Gain", "x",
                                  NULL);
          // ═══════════════════════════════════════════════════════════════════

          // ═══════════════════════════════════════════════════════════════════
          // LED Status Controls
          // ═══════════════════════════════════════════════════════════════════
          mqtt_ha_register_switch("led_enabled", "LED Status Indicator",
                                  mqtt_led_switch_callback);
          mqtt_ha_register_number("led_brightness", "LED Brightness", 0, 100,
                                  10, "%", mqtt_led_brightness_callback);
          // ═══════════════════════════════════════════════════════════════════

          ESP_LOGI(TAG, "Home Assistant entities registered (17 sensors, 4 "
                        "switches, 9 buttons, 7 numbers)");

          // ═══════════════════════════════════════════════════════════════════
          // >>> NOVO: Inicijalni VA status <<<
          // ═══════════════════════════════════════════════════════════════════
          vTaskDelay(pdMS_TO_TICKS(500));
          mqtt_ha_update_sensor("va_status", "SPREMAN");
          mqtt_ha_update_sensor("va_response", "Voice Assistant spreman!");
          // ═══════════════════════════════════════════════════════════════════

          // ═══════════════════════════════════════════════════════════════════
          // Initialize AGC if enabled by default
          // ═══════════════════════════════════════════════════════════════════
          if (agc_enabled) {
            esp_err_t agc_ret = audio_capture_enable_agc(agc_target_level);
            if (agc_ret == ESP_OK) {
              ESP_LOGI(TAG, "AGC enabled with target level: %u",
                       agc_target_level);
              mqtt_ha_update_switch("agc_enabled", true);
            } else {
              ESP_LOGW(TAG, "Failed to enable AGC");
              agc_enabled = false;
              mqtt_ha_update_switch("agc_enabled", false);
            }
          }
          mqtt_ha_update_number("agc_target_level", (float)agc_target_level);
          // ═══════════════════════════════════════════════════════════════════

          // ═══════════════════════════════════════════════════════════════════
          // Initialize LED status
          // ═══════════════════════════════════════════════════════════════════
          mqtt_ha_update_switch("led_enabled", led_status_is_enabled());
          mqtt_ha_update_number("led_brightness", (float)led_status_get_brightness());
          ESP_LOGI(TAG, "LED status initialized: %s, brightness: %u%%",
                   led_status_is_enabled() ? "ON" : "OFF", led_status_get_brightness());
          // ═══════════════════════════════════════════════════════════════════

          xTaskCreate(mqtt_status_update_task, "mqtt_status", 4096, NULL, 3,
                      NULL);
          ESP_LOGI(TAG, "MQTT status update task started");
        } else {
          ESP_LOGW(TAG, "Failed to start MQTT client");
        }
      } else {
        ESP_LOGW(TAG, "Failed to initialize MQTT client");
      }

      ESP_LOGI(TAG, "All systems initialized - marking OTA partition as valid");
      ota_update_mark_valid();

      if (wwd_ret == ESP_OK && wwd_is_running() == false) {
        ESP_LOGI(TAG, "========================================");
        ESP_LOGI(TAG, "🎙️  Voice Assistant Ready!");
        ESP_LOGI(TAG, "Wake Word Detection enabled");
        ESP_LOGI(TAG, "Say the wake word to activate!");
        ESP_LOGI(TAG, "Wake word: 'Hi ESP' (or your chosen model)");
        ESP_LOGI(TAG, "========================================");

        wwd_start();
        audio_capture_start_wake_word_mode(wwd_audio_feed_wrapper);

        // LED to green - wake word ready
        led_status_set(LED_STATUS_IDLE);
      } else {
        ESP_LOGI(TAG, "========================================");
        ESP_LOGI(TAG, "🎙️  Voice Assistant Ready!");
        ESP_LOGI(TAG, "Using VAD-based activation");
        ESP_LOGI(TAG, "System will start recording in 5 seconds...");
        ESP_LOGI(TAG, "Just start speaking - VAD will detect automatically!");
        ESP_LOGI(TAG, "========================================");
        vTaskDelay(pdMS_TO_TICKS(5000));
        test_audio_streaming();
      }
    } else {
      ESP_LOGW(TAG, "Home Assistant connection failed");
    }
  } else {
    ESP_LOGW(TAG, "WiFi connection failed, continuing without network");
  }

  ESP_LOGI(TAG, "MP3 playback disabled (Voice Assistant mode)");
  ESP_LOGI(TAG, "Audio codec is ready for Voice Assistant development");
  ESP_LOGI(TAG, "System idle - ready to process voice commands...");

  while (1) {
    vTaskDelay(pdMS_TO_TICKS(1000));
  }
}